src/bsl/InformationRegisters/гкс_НастройкиНапоминанияПользователя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>гкс_НастройкиНапоминанияПользователя</Name>
			<Comment>GKSTCPLK-317</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Настройки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/bsl/InformationRegisters/гкс_НастройкиНапоминанияПользователя/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Получает настройки напоминания
// 
// Параметры:
//  Объект - СправочникСсылка.ИдентификаторыОбъектовМетаданных - Ссылка на идентификатор объекта метаданных
//
// Возвращаемое значение:
//  Структура, Неопределено - настройки напоминания.
//
Функция ПолучитьНастройкиНапоминания(Объект) Экспорт
	
	Настройки = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РСНастройкиНапоминанияПользователя.Настройки КАК Настройки
		|ИЗ
		|	РегистрСведений.гкс_НастройкиНапоминанияПользователя КАК РСНастройкиНапоминанияПользователя
		|ГДЕ
		|	РСНастройкиНапоминанияПользователя.Объект = &Объект";
	
	Запрос.УстановитьПараметр("Объект", Объект);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Настройки = Выборка.Настройки.Получить();
	КонецЦикла;
	
    Возврат Настройки;

КонецФункции

#КонецОбласти

#КонецЕсли
